In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.257017 -0.087500  0.008311  0.806570
1 -0.286604 -0.258521 -0.139679  0.384430
2 -0.067083 -1.727760 -1.306487 -1.584992
3  0.000118  1.437448 -0.174485  2.924672
4  0.899486  0.205355  2.529192  0.937957
5  0.039047 -0.125896  0.175293  1.202885
6 -0.123016 -0.216377 -2.099948 -0.300151
7  0.175235 -0.651700  0.458136  0.173997
8  0.571872 -1.590326 -0.048240  2.217295
9  0.653992 -2.014366 -0.559097  0.594947

In [4]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.257017 -0.087500  0.008311  0.806570
 1 -0.286604 -0.258521 -0.139679  0.384430
 2 -0.067083 -1.727760 -1.306487 -1.584992,
           0         1         2         3
 3  0.000118  1.437448 -0.174485  2.924672
 4  0.899486  0.205355  2.529192  0.937957
 5  0.039047 -0.125896  0.175293  1.202885
 6 -0.123016 -0.216377 -2.099948 -0.300151,
           0         1         2         3
 7  0.175235 -0.651700  0.458136  0.173997
 8  0.571872 -1.590326 -0.048240  2.217295
 9  0.653992 -2.014366 -0.559097  0.594947]

In [5]:
pd.concat(pieces)

          0         1         2         3
0  0.257017 -0.087500  0.008311  0.806570
1 -0.286604 -0.258521 -0.139679  0.384430
2 -0.067083 -1.727760 -1.306487 -1.584992
3  0.000118  1.437448 -0.174485  2.924672
4  0.899486  0.205355  2.529192  0.937957
5  0.039047 -0.125896  0.175293  1.202885
6 -0.123016 -0.216377 -2.099948 -0.300151
7  0.175235 -0.651700  0.458136  0.173997
8  0.571872 -1.590326 -0.048240  2.217295
9  0.653992 -2.014366 -0.559097  0.594947

In [6]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [7]:
pd.merge(left, right, on='key', how='outer')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [9]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
'foo', 'bar', 'foo', 'foo'],
'B': ['one', 'one', 'two', 'three',
'two', 'two', 'one', 'three'],
'C': np.random.randn(8),
'D': np.random.randn(8)})

df.groupby('A').sum()

            C         D
A
bar -2.121576 -1.308455
foo  0.726415 -0.091375

In [10]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.441578 -1.124572
    three -1.395949  0.808649
    two   -0.284048 -0.992531
foo one   -0.475048  0.195667
    three -0.587646  0.303358
    two    1.789110 -0.590400

In [12]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
'foo', 'foo', 'qux', 'qux'],
['one', 'two', 'one', 'two',
'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [13]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.145921  1.084940
      two     1.832257 -0.781967
baz   one     1.035716  0.545503
      two     0.591150  1.183456

In [15]:
stacked = df2.stack()
type(stacked)

pandas.core.series.Series

In [16]:
stacked

first  second
bar    one     A   -0.145921
               B    1.084940
       two     A    1.832257
               B   -0.781967
baz    one     A    1.035716
               B    0.545503
       two     A    0.591150
               B    1.183456
dtype: float64

In [17]:
stacked.unstack()

                     A         B
first second
bar   one    -0.145921  1.084940
      two     1.832257 -0.781967
baz   one     1.035716  0.545503
      two     0.591150  1.183456

In [19]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.145921  1.035716
       B  1.084940  0.545503
two    A  1.832257  0.591150
       B -0.781967  1.183456

In [20]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
'B': ['A', 'B', 'C'] * 4,
'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
'D': np.random.randn(12),
'E': np.random.randn(12)})

In [21]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.259960  2.523843
      B  1.688936  1.570221
      C -0.387404  1.476709
three A  0.570735       NaN
      B       NaN  0.994866
      C -0.693391       NaN
two   A       NaN  0.690672
      B -0.982480       NaN
      C       NaN -1.474246

In [24]:
def extract_city_name(df):
    """
    Chicago, IL -> Chicago for city_name column
    """
    df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
    return df

In [25]:
def add_country_name(df, country_name=None):
    """
    Chicago -> Chicago-US for city_name column
    """
    col = 'city_name'
    df['city_and_country'] = df[col] + country_name
    return df

In [28]:
df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})
df_p

  city_and_code
0   Chicago, IL

In [27]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [29]:
## use .pipe to chain functions together
(df_p.pipe(extract_city_name)
.pipe(add_country_name, country_name="US"))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [31]:
df = pd.DataFrame({
'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  0.832768 -0.715660       NaN
b -0.427267 -0.487578 -0.485354
c -1.507046  0.126152 -1.620610
d       NaN -0.289975 -0.018896

In [32]:
df.apply(np.mean)

one     -0.367182
two     -0.341765
three   -0.708287
dtype: float64

In [33]:
df.apply(np.mean, axis=1)

a    0.058554
b   -0.466733
c   -1.000502
d   -0.154436
dtype: float64

In [34]:
df.apply(lambda x: x.max() - x.min())

one      2.339815
two      0.841811
three    1.601714
dtype: float64

In [35]:
df.apply(np.cumsum)

        one       two     three
a  0.832768 -0.715660       NaN
b  0.405502 -1.203237 -0.485354
c -1.101545 -1.077086 -2.105964
d       NaN -1.367061 -2.124860

In [36]:
df.apply(np.exp)

        one       two     three
a  2.299677  0.488870       NaN
b  0.652289  0.614112  0.615480
c  0.221563  1.134454  0.197778
d       NaN  0.748282  0.981281